app/controllers/venues_controller.rb

INSERT INTO "venues" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Fri, 02 Aug 2013 23:12:14 UTC +00:00], ["updated_at", Fri, 02 Aug 2013 23:12:14 UTC +00:00]]
---
  def create
    @venue = Venue.new(venue_params)

    if @venue.save

UPDATE "venues" SET "name" = ?, "updated_at" = ? WHERE "venues"."id" = 1  [["name", "Theater in the Round"], ["updated_at", Sat, 03 Aug 2013 00:12:02 UTC +00:00]]
---
  def update
    if @venue.update(venue_params)

SELECT "venues".* FROM "venues" WHERE "venues"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_venue
      @venue = Venue.find(params[:id])